Revit 2027 API
ExternalServices.BuiltInExternalServices.ExternalResourceService Property
 The external service which permits registration of an alternate servers for managing external resources such as linked files.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ExternalResourceService { get; }
Public Shared ReadOnly Property ExternalResourceService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ExternalResourceService {
	ExternalServiceId^ get ();
}
static member ExternalResourceService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace